In [3]:
import pandas as pd
import numpy as np

movieInfo = pd.read_csv("movies.csv", usecols = ['movieId', 'title'], dtype = {'movieId' : 'int32', 'title' : 'str'});

In [62]:
movieInfo.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [5]:
movieRatings = pd.read_csv("ratings.csv", usecols = ['userId', 'movieId', 'rating'], dtype = {'userId' : 'int32', 'movieId' : 'int32', 'rating' : 'float32'});

In [61]:
movieRatings.head()

   userId  movieId  rating
0       1        1   4.000
1       1        3   4.000
2       1        6   4.000
3       1       47   5.000
4       1       50   5.000

In [7]:
onMovIdMerged = pd.merge(movieRatings, movieInfo,on= 'movieId');

In [60]:
onMovIdMerged.head()

   userId  movieId  rating             title
0       1        1   4.000  Toy Story (1995)
1       5        1   4.000  Toy Story (1995)
2       7        1   4.500  Toy Story (1995)
3      15        1   2.500  Toy Story (1995)
4      17        1   4.500  Toy Story (1995)

In [9]:
cleanedDataFrame = onMovIdMerged.dropna(axis = 0, subset = ['title']);

In [59]:
cleanedDataFrame.head()

   userId  movieId  rating             title
0       1        1   4.000  Toy Story (1995)
1       5        1   4.000  Toy Story (1995)
2       7        1   4.500  Toy Story (1995)
3      15        1   2.500  Toy Story (1995)
4      17        1   4.500  Toy Story (1995)

In [55]:
ratingCount = (cleanedDataFrame.groupby(by = ['title'])['rating'].count().reset_index().rename(columns = {'rating': 'totalRatingCount'})[['title', 'totalRatingCount']]);
ratingCount.head()

                                     title  totalRatingCount
0                               '71 (2014)                 1
1  'Hellboy': The Seeds of Creation (2004)                 1
2                   'Round Midnight (1986)                 2
3                      'Salem's Lot (2004)                 1
4                'Til There Was You (1997)                 2

In [73]:
totalRatingCount = cleanedDataFrame.merge(ratingCount, left_on = 'title', right_on = 'title', how = 'left');
totalRatingCount

,userId,movieId,rating,title,totalRatingCount
0,1,1,4.000,Toy Story (1995),215
1,5,1,4.000,Toy Story (1995),215
2,7,1,4.500,Toy Story (1995),215
3,15,1,2.500,Toy Story (1995),215
4,17,1,4.500,Toy Story (1995),215
...,...,...,...,...,...
100831,610,160341,2.500,Bloodmoon (1997),1
100832,610,160527,4.500,Sympathy for the Underdog (1971),1
100833,610,160836,3.000,Hazard (2005),1
100834,610,163937,3.500,Blair Witch (2016),1
100835,610,163981,3.500,31 (2016),1

In [ ]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)
ratingCount['totalRatingCount'].describe()

In [ ]:
threshold = 40
ratingPopularMovie = totalRatingCount.query('totalRatingCount >= @threshold');
print(ratingPopularMovie);

In [ ]:
pivotMatrix = ratingPopularMovie.pivot_table(index='title',columns='userId',values='rating').fillna(0);
pivotMatrix

In [ ]:
from scipy.sparse import csr_matrix

In [ ]:
pivotArray = csr_matrix(pivotMatrix.values);

In [ ]:
print(pivotArray)

In [ ]:
from sklearn.neighbors import NearestNeighbors

In [ ]:
knn = NearestNeighbors(metric = 'cosine', algorithm = 'brute')
knn.fit(pivotArray)

In [ ]:
query = np.random.choice(pivotMatrix.shape[0]);
print(query);
distances, indices = knn.kneighbors(pivotMatrix.iloc[query,:].values.reshape(1, -1), n_neighbors = 6)

In [ ]:
for i in range(0, len(distances.flatten())):
    if i == 0:
        print('Recommendations for {0}:\n'.format(pivotMatrix.index[query]))
    else:
        print('{0}: {1}, with distance of {2}:'.format(i, pivotMatrix.index[indices.flatten()[i]], distances.flatten()[i]))

In [ ]:
from werkzeug.wrappers import Request, Response
from flask import Flask

app = Flask(__name__)

@app.route("/")
def hello():
    return "Hello World!"

if __name__ == '__main__':
    from werkzeug.serving import run_simple
    run_simple('localhost', 9000, app)